app/controllers/books_controller.rb

SELECT "books".* FROM "books"   ORDER BY created_at
---
  def index
      @books = Book.order("created_at").last(10)
      respond_with(@books)
    if params[:search]
      @books= Book.search(params[:search]).order("created_at DESC")

UPDATE "books" SET "original_title" = ?, "translation" = ?, "updated_at" = ? WHERE "books"."id" = 9  [["original_title", ""], ["translation", ""], ["updated_at", "2017-01-23 05:23:44.708547"]]
---
  def update
    @book.update(book_params)